# Position Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalOrigin..::..Position Property
InternalOrigin Class See Also
---
The position of the InternalOrigin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.2
# Syntax
C#
---
```text
public XYZ Position { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Position As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Position {
	XYZ^ get ();
}
```

# See Also
InternalOrigin Class
Autodesk.Revit.DB Namespace